# Posttest 2

# Import Package
Library Pandas

In [11]:
import pandas as pd

# Membaca Dataset

In [12]:
data = pd.read_csv("vgsales.csv")
data.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

# Informasi Dataset

In [13]:
totalrecord = len(data)
attribute = list(data.columns)
objek = len(data.select_dtypes(include=['object']).columns)
angka = len(data.select_dtypes(include=['int64', 'float64']).columns)
NULL = len(data.columns[data.isna().sum() > 0])


dict = {
    "Total Record"            : totalrecord,
    "Nama Attribute"          : attribute,
    "Jumlah Attribute Objek"  : objek,
    "Jumlah Attribute Angka"  : angka,
    "Jumlah NULL"             : NULL,
}

pd.Series(dict)

Total Record                                                          16598
Nama Attribute            [Rank, Name, Platform, Year, Genre, Publisher,...
Jumlah Attribute Objek                                                    4
Jumlah Attribute Angka                                                    7
Jumlah NULL                                                               2
dtype: object

# Atribut Bertipe Angka 

**Rank**\
**Year**\
**NA_Sales**\
**EU_Sales**\
**JP_Sales**\
**Other_Sales**\
**Global_Sales**

# Menampilkan Nilai Rata-Rata 

Menampilkan rata-rata dengan fungsi mean()

In [14]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].mean()

NA_Sales        0.264667
EU_Sales        0.146652
JP_Sales        0.077782
Other_Sales     0.048063
Global_Sales    0.537441
dtype: float64

# Menampilkan Nilai Standar Deviasi

Menampilkan standar deviasi dengan fungsi std()

In [15]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].std()

NA_Sales        0.816683
EU_Sales        0.505351
JP_Sales        0.309291
Other_Sales     0.188588
Global_Sales    1.555028
dtype: float64

# Menampilkan Nilai Minimum
Menampilkan minimum dengan fungsi min()

In [16]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].min()

NA_Sales        0.00
EU_Sales        0.00
JP_Sales        0.00
Other_Sales     0.00
Global_Sales    0.01
dtype: float64

# Menampilkan Nilai Maksimum
Menampilkan maksimum dengan fungsi max()

In [17]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].max()

NA_Sales        41.49
EU_Sales        29.02
JP_Sales        10.22
Other_Sales     10.57
Global_Sales    82.74
dtype: float64

# Menampilkan Q1, Q2, Q3 
Menampilkan kuantil dengan fungsi quantile()

**0.25 untuk Q1**\
**0.5  untuk Q2**\
**0.75 untuk Q3**

In [18]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].quantile([0.25,0.5,0.75])

      NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0.25      0.00      0.00      0.00         0.00          0.06
0.50      0.08      0.02      0.00         0.01          0.17
0.75      0.24      0.11      0.04         0.04          0.47

# Menampilkan Statistik Deskriptif

Menampilkan total record, rata-rata, simpangan baku, nilai minimum, maksimum,\
dan kuantil dengan menggunakan fungsi **describe()**

In [19]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].describe()

           NA_Sales      EU_Sales      JP_Sales   Other_Sales  Global_Sales
count  16598.000000  16598.000000  16598.000000  16598.000000  16598.000000
mean       0.264667      0.146652      0.077782      0.048063      0.537441
std        0.816683      0.505351      0.309291      0.188588      1.555028
min        0.000000      0.000000      0.000000      0.000000      0.010000
25%        0.000000      0.000000      0.000000      0.000000      0.060000
50%        0.080000      0.020000      0.000000      0.010000      0.170000
75%        0.240000      0.110000      0.040000      0.040000      0.470000
max       41.490000     29.020000     10.220000     10.570000     82.740000

# Menampilkan Nilai Korelasi

Menampilkan nilai korelasi dengan fungsi corr()

In [20]:
data[["NA_Sales","EU_Sales","JP_Sales","Other_Sales","Global_Sales"]].corr()

              NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
NA_Sales      1.000000  0.767727  0.449787     0.634737      0.941047
EU_Sales      0.767727  1.000000  0.435584     0.726385      0.902836
JP_Sales      0.449787  0.435584  1.000000     0.290186      0.611816
Other_Sales   0.634737  0.726385  0.290186     1.000000      0.748331
Global_Sales  0.941047  0.902836  0.611816     0.748331      1.000000

# Merubah Atributte Menjadi Angka Bulat

Atributte yang akan dirubah yaitu **Global_Sales** yang sebelumnya bilangan Desimal menjadi bilangan Bulat\
dengan menggunakan fungsi **astype()**

In [35]:
print("Sebelum di Ubah : ",data["Global_Sales"].dtypes)

data["Global_Sales"] = data["Global_Sales"].astype('int64')

print("Setelah di Ubah : ", data["Global_Sales"].dtypes)

Sebelum di Ubah :  float64
Setelah di Ubah :  int64

# Menampilkan Attribute Bertipe Angka


Data yang ditampilkan yaitu 10 record pertama dengan fungsi head()\
10 merupakan berapa banyak record yang ingin ditampilkan

In [36]:
data.select_dtypes(include=['int64', 'float64']).head(10)

   Rank    Year  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0     1  2006.0     41.49     29.02      3.77         8.46            82
1     2  1985.0     29.08      3.58      6.81         0.77            40
2     3  2008.0     15.85     12.88      3.79         3.31            35
3     4  2009.0     15.75     11.01      3.28         2.96            33
4     5  1996.0     11.27      8.89     10.22         1.00            31
5     6  1989.0     23.20      2.26      4.22         0.58            30
6     7  2006.0     11.38      9.23      6.50         2.90            30
7     8  2006.0     14.03      9.20      2.93         2.85            29
8     9  2009.0     14.59      7.06      4.70         2.26            28
9    10  1984.0     26.93      0.63      0.28         0.47            28

# Export Record ke File csv Baru

Record yang di Export ke file csv baru merupakan attribute bertipe angka

In [37]:
data.select_dtypes(include=['int64', 'float64']).to_csv("Atribut Angka.csv", index=False)